products/admin/fedexwsdl/RateRequest_F2_Sat_Pickup_v13.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RateRequest>
         <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key></v13:Key>
               <v13:Password/>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber></v13:AccountNumber>
            <v13:MeterNumber></v13:MeterNumber>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>RateRequest_F2_Sat_Pickup</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2011-06-18T09:30:47-05:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>FEDEX_2_DAY_FREIGHT</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:TotalWeight>
               <v13:Units>LB</v13:Units>
               <v13:Value>151.0</v13:Value>
            </v13:TotalWeight>
            <v13:Shipper>
               <v13:AccountNumber/>
               <v13:Contact>
                  <v13:CompanyName>FedEx-WAPI</v13:CompanyName>
                  <v13:PhoneNumber>1234567890</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>SN2000 Test Meter 8</v13:StreetLines>
                  <v13:StreetLines>10 Fedex Parkway</v13:StreetLines>
                  <v13:City>Detroit</v13:City>
                  <v13:StateOrProvinceCode>MI</v13:StateOrProvinceCode>
                  <v13:PostalCode>48208</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:Contact>
                  <v13:PersonName>Recipient Contact</v13:PersonName>
                  <v13:PhoneNumber>1234567890</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Recipient Address Line 1</v13:StreetLines>
                  <v13:StreetLines>Recipient Address Line 2</v13:StreetLines>
                  <v13:City>Millbrae</v13:City>
                  <v13:StateOrProvinceCode>CA</v13:StateOrProvinceCode>
                  <v13:PostalCode>94030</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
               </v13:Address>
            </v13:Recipient>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber/>
                     <v13:Tins>
                        <v13:TinType>BUSINESS_STATE</v13:TinType>
                        <v13:Number>123456</v13:Number>
                     </v13:Tins>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:SpecialServicesRequested>
               <v13:SpecialServiceTypes>SATURDAY_PICKUP</v13:SpecialServiceTypes>
            </v13:SpecialServicesRequested>
            <v13:LabelSpecification>
               <v13:LabelFormatType>COMMON2D</v13:LabelFormatType>
               <v13:ImageType>PNG</v13:ImageType>
               <v13:LabelStockType>PAPER_4X6</v13:LabelStockType>
            </v13:LabelSpecification>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <v13:PackageCount>1</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupPackageCount>1</v13:GroupPackageCount>
               <v13:Weight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>151.0</v13:Value>
               </v13:Weight>
               <v13:Dimensions>
                  <v13:Length>30</v13:Length>
                  <v13:Width>30</v13:Width>
                  <v13:Height>40</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:Dimensions>
               <v13:ContentRecords>
                  <v13:PartNumber>123445</v13:PartNumber>
                  <v13:ItemNumber>kjdjalsro1262739827</v13:ItemNumber>
                  <v13:ReceivedQuantity>12</v13:ReceivedQuantity>
                  <v13:Description>ContentDescription</v13:Description>
               </v13:ContentRecords>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>